HamidHekmatnezhad/Kuruma_Uni_Project_Mikrocontroller/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MK66FN2M0xxx18
package_id: MK66FN2M0VMD18
mcu_data: ksdk2_0
processor_version: 15.0.1
board: FRDM-K66F
pin_labels:
- {pin_num: A1, pin_signal: PTD7/CMT_IRO/UART0_TX/FTM0_CH7/SDRAM_CKE/FTM0_FLT1/SPI1_SIN, label: 'J6[7]/SPI1_SIN/MISO'}
- {pin_num: B1, pin_signal: PTD12/SPI2_SCK/FTM3_FLT0/SDHC0_D4/FB_A20, label: 'J2[19]/FB_A20', identifier: FB_A20;BTN_CHANGE_PWM}
- {pin_num: C1, pin_signal: PTD15/SPI2_PCS1/SDHC0_D7/FB_A23, label: NC}
- {pin_num: D1, pin_signal: ADC1_SE6a/PTE2/LLWU_P1/SPI1_SCK/UART1_CTS_b/SDHC0_DCLK/TRACE_D2, label: SDHC0_DCLK, identifier: SDHC0_DCLK}
- {pin_num: E1, pin_signal: PTE6/LLWU_P16/SPI1_PCS3/UART3_CTS_b/I2S0_MCLK/FTM3_CH1/USB0_SOF_OUT, label: LEDRGB_GREEN, identifier: LED_GREEN}
- {pin_num: F1, pin_signal: PTE10/LLWU_P18/I2C3_SDA/I2S0_TXD0/LPUART0_CTS_b/FTM3_CH5/USB1_ID, label: USB_ID, identifier: USB_ID}
- {pin_num: G1, pin_signal: VREG_OUT, label: C81, identifier: C81}
- {pin_num: J1, pin_signal: USB1_DP/LLWU_P30, label: K66_MICRO_USB_DP, identifier: K66_MICRO_USB_DP_DCD;K66_MICRO_USB_DP_PHY}
- {pin_num: H1, pin_signal: USB0_DP, label: NC}
- {pin_num: K1, pin_signal: USB1_DM/LLWU_P31, label: K66_MICRO_USB_DN, identifier: K66_MICRO_USB_DN_DCD;K66_MICRO_USB_DN_PHY}
- {pin_num: L1, pin_signal: USB1_VBUS/LLWU_P29, label: P5V_K66_USB, identifier: P5V_K66_USB}
- {pin_num: M1, pin_signal: ADC1_DP0/ADC0_DP3, label: 'J4[1]/DIFF_ADC1_DP0', identifier: DIFF_ADC1_DP0;POT_CHANNEL_BLK}
- {pin_num: A2, pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FB_AD0/FTM0_FLT0/SPI1_SOUT, label: 'J6[6]/SPI1_SOUT/MOSI'}
- {pin_num: B2, pin_signal: PTD11/LLWU_P25/SPI2_PCS0/SDHC0_CLKIN/LPUART0_CTS_b/FB_A19, label: SW2, identifier: SW2}
- {pin_num: C2, pin_signal: PTD14/SPI2_SIN/SDHC0_D6/FB_A22, label: NC}
- {pin_num: D2, pin_signal: ADC1_SE5a/PTE1/LLWU_P0/SPI1_SOUT/UART1_RX/SDHC0_D0/TRACE_D3/I2C1_SCL/SPI1_SIN, label: SDHC0_D0, identifier: SDHC0_D0}
- {pin_num: E2, pin_signal: PTE5/SPI1_PCS2/UART3_RX/SDHC0_D2/FTM3_CH0, label: SDHC0_D2, identifier: SDHC0_D2}
- {pin_num: F2, pin_signal: PTE9/LLWU_P17/I2S0_TXD1/I2S0_RX_BCLK/LPUART0_RX/FTM3_CH4, label: 'J30[3]/U22[3]/I2S_RX_BCLK', identifier: I2S_RX_BCLK}
- {pin_num: G2, pin_signal: VREG_IN0, label: VREGIN_K66}
- {pin_num: J2, pin_signal: VREG_IN1, label: VREGIN_K66}
- {pin_num: H2, pin_signal: USB0_DM, label: NC}
- {pin_num: K2, pin_signal: USB1_VSS, label: GND}
- {pin_num: L2, pin_signal: ADC0_DM0/ADC1_DM3, label: 'J2[3]/ADC0_DM0_RC', identifier: ADC0_DM0_RC;MOTOR_STAR_ADC0_SE19}
- {pin_num: M2, pin_signal: ADC1_DM0/ADC0_DM3, label: 'J4[3]/DIFF_ADC1_DM0', identifier: DIFF_ADC1_DM0;POT_CHANNEL}
- {pin_num: A3, pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FB_AD1/SDRAM_A9/EWM_OUT_b/SPI1_SCK, label: 'J6[7]/SPI1_SCK/SCK'}
- {pin_num: B3, pin_signal: PTD10/LPUART0_RTS_b/FB_A18, label: SD_CARD_DETECT, identifier: SDCARD_CARD_DETECTION}
- {pin_num: C3, pin_signal: PTD13/SPI2_SOUT/SDHC0_D5/FB_A21, label: 'J2[17]/FB_A21', identifier: FB_A21;BTN_START_MOTOR}
- {pin_num: D3, pin_signal: ADC1_SE4a/PTE0/SPI1_PCS1/UART1_TX/SDHC0_D1/TRACE_CLKOUT/I2C1_SDA/RTC_CLKOUT, label: SDHC0_D1, identifier: SDHC0_D1}
- {pin_num: E3, pin_signal: PTE4/LLWU_P2/SPI1_PCS0/UART3_TX/SDHC0_D3/TRACE_D0, label: SDHC0_D3, identifier: SDHC0_D3}
- {pin_num: F3, pin_signal: PTE8/I2S0_RXD1/I2S0_RX_FS/LPUART0_TX/FTM3_CH3, label: 'J1[13]/J34[3]/J38[1]/I2S_RX_WCLK/I2S_RXD1', identifier: I2S_RX_WCLK_RXD1}
- {pin_num: G3, pin_signal: PTE12/I2S0_TX_BCLK/FTM3_CH7, label: 'J1[1]/J37[3]/I2S_TX_BCLK', identifier: I2S_TX_BCLK;SER1}
- {pin_num: H3, pin_signal: VSS6, label: GND}
- {pin_num: J3, pin_signal: ADC0_SE16/CMP1_IN2/ADC0_SE21, label: 'J4[5]/ADC0', identifier: ADC0_SE16}
- {pin_num: K3, pin_signal: ADC1_SE16/CMP2_IN2/ADC0_SE22, label: 'J4[7]/ADC1', identifier: ADC1_SE16}
- {pin_num: L3, pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23, label: 'J4[11]/DAC_OUT', identifier: DAC0_OUT;MOTOR_BEMF10_C_ADC0_SE23}
- {pin_num: M3, pin_signal: VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18, label: 'J2[1]/ADC1_SE18_RC', identifier: ADC1_SE18_RC}
- {pin_num: A4, pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FB_AD2/SDRAM_A10/EWM_IN/SPI1_PCS0, label: 'J6[4]/SPI1_PCS0/CS'}
- {pin_num: B4, pin_signal: PTD3/SPI0_SIN/UART2_TX/FTM3_CH3/FB_AD3/SDRAM_A11/I2C0_SDA, label: 'J2[10]/SPI0_SIN/FB_AD3', identifier: SPI0_SIN;I2c0_SIN}
- {pin_num: C4, pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/FTM3_CH2/FB_AD4/SDRAM_A12/I2C0_SCL, label: 'J2[8]/SPI0_SOUT/FB_AD4', identifier: SPI0_SOUT;I2C0_SOUT}
- {pin_num: D4, pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/UART2_CTS_b/FTM3_CH1/FB_CS0_b, label: 'J2[12]/SPI0_SCK/FB_CS0_B', identifier: SPI0_SCK}
- {pin_num: E4, pin_signal: ADC1_SE7a/PTE3/SPI1_SIN/UART1_RTS_b/SDHC0_CMD/TRACE_D1/SPI1_SOUT, label: SDHC0_CMD, identifier: SDHC0_CMD}
- {pin_num: F4, pin_signal: PTE7/UART3_RTS_b/I2S0_RXD0/FTM3_CH2, label: 'J1[15]/J34[1]/U20[C7]/I2S_RXD0', identifier: I2S_RXD0}
- {pin_num: G4, pin_signal: PTE11/I2C3_SCL/I2S0_TX_FS/LPUART0_RTS_b/FTM3_CH6, label: 'J1[3]/J38[3]/I2S_TX_WCLK', identifier: I2S_TX_WCLK;SERVO0}
- {pin_num: H4, pin_signal: PTE28, label: 'J14[1]/ETHERNET_RST/PET_1_RST_B'}
- {pin_num: J4, pin_signal: PTE27/UART4_RTS_b, label: NC}
- {pin_num: K4, pin_signal: PTE26/ENET_1588_CLKIN/UART4_CTS_b/RTC_CLKOUT/USB0_CLKIN, label: 'U13[16]/ETHERNET_CLOCK', identifier: ETHERNET_CLOCK;ENET_1588_CLKIN}
- {pin_num: L4, pin_signal: DAC1_OUT/CMP0_IN4/CMP2_IN3/ADC1_SE23, label: 'J2[5]/ADC1_SE23_RC', identifier: ADC1_SE23_RC}
- {pin_num: M4, pin_signal: ADC0_SE17/PTE24/CAN1_TX/UART4_TX/I2C0_SCL/EWM_OUT_b, label: 'J2[13]/ADC0_SE17', identifier: ADC0_SE17;MOTOR_BEMF1_B_ADC0_SE17}
- {pin_num: A5, pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b, label: 'J2[6]/SPI0_PCS0/FTM3_CH0', identifier: SPI0_PCS0}
- {pin_num: C5, pin_signal: PTC18/UART3_RTS_b/ENET0_1588_TMR2/FB_TBST_b/FB_CS2_b/FB_BE15_8_BLS23_16_b/SDRAM_DQM1, label: 'J6[8]/RF_WIFI_IRQ'}
- {pin_num: B5, pin_signal: PTC19/UART3_CTS_b/ENET0_1588_TMR3/FB_CS3_b/FB_BE7_0_BLS31_24_b/SDRAM_DQM0/FB_TA_b, label: NC}
- {pin_num: D5, pin_signal: PTC17/CAN1_TX/UART3_TX/ENET0_1588_TMR1/FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b/SDRAM_DQM3, label: 'U8[11]/FXOS8700CQ_INT1', identifier: ACCEL_INT1}
- {pin_num: E5, pin_signal: VDD5, label: P3V3_K66F}
- {pin_num: F5, pin_signal: VDD126, label: P3V3_K66F}
- {pin_num: G5, pin_signal: VREFH, label: VREFH}
- {pin_num: H5, pin_signal: VDDA, label: P3V3_K66F}
- {pin_num: J5, pin_signal: TSI0_CH1/PTA0/UART0_CTS_b/UART0_COL_b/FTM0_CH5/LPUART0_CTS_b/JTAG_TCLK/SWD_CLK/EZP_CLK, label: 'J8[2]/J9[4]/JTAG_TCLK/SWD_CLK/EZP_CLK',
  identifier: SWD_CLK}
- {pin_num: K5, pin_signal: ADC0_SE18/PTE25/LLWU_P21/CAN1_RX/UART4_RX/I2C0_SDA/EWM_IN, label: 'J2[15]/ADC0_SE18', identifier: ADC0_SE18;MOTOR_BEMF1_C_ADC0_SE18}
- {pin_num: L5, pin_signal: RTC_WAKEUP_B, label: RTC_WAKEUP/TP18}
- {pin_num: M5, pin_signal: NC184, label: NC}
- {pin_num: A6, pin_signal: PTC16/CAN1_RX/UART3_RX/ENET0_1588_TMR0/FB_CS5_b/FB_TSIZ1/FB_BE23_16_BLS15_8_b/SDRAM_DQM2, label: 'J1[6]/ENET0_1588_TMR0', identifier: ENET0_1588_TMR0}
- {pin_num: B6, pin_signal: PTC15/UART4_TX/FB_AD24/SDRAM_D24, label: 'J199[4]/K66F_UART4_TX', identifier: K66F_UART4_TX}
- {pin_num: C6, pin_signal: PTC14/UART4_RX/FB_AD25/SDRAM_D25, label: 'J199[3]/K66F_UART4_RX', identifier: K66F_UART4_RX}
- {pin_num: D6, pin_signal: PTC13/UART4_CTS_b/FTM_CLKIN1/FB_AD26/SDRAM_D26/TPM_CLKIN1, label: 'U8[9]/FXOS8700CQ_INT2', identifier: ACCEL_INT2}
- {pin_num: E6, pin_signal: VDD16, label: P3V3_K66F}
- {pin_num: F6, pin_signal: VSS22, label: GND}
- {pin_num: G6, pin_signal: VREFL, label: GND}
- {pin_num: H6, pin_signal: VSSA, label: GND}
- {pin_num: J6, pin_signal: TSI0_CH2/PTA1/UART0_RX/FTM0_CH6/I2C3_SDA/LPUART0_RX/JTAG_TDI/EZP_DI, label: 'J3[15]/FTM0_CH6', identifier: FTM0_CH6;MOTOR_EN_c_PTA1;MOTOR_EN_C_PTA1}
- {pin_num: K6, pin_signal: TSI0_CH3/PTA2/UART0_TX/FTM0_CH7/I2C3_SCL/LPUART0_TX/JTAG_TDO/TRACE_SWO/EZP_DO, label: 'J9[6]/JTAG_TDO/TRACE_SWO/EZP_DO', identifier: TRACE_SWO}
- {pin_num: L6, pin_signal: VBAT, label: VBAT}
- {pin_num: M6, pin_signal: EXTAL32, label: 'Y3[2]', identifier: EXTAL32K}
- {pin_num: A7, pin_signal: PTC12/UART4_RTS_b/FTM_CLKIN0/FB_AD27/SDRAM_D27/FTM3_FLT0/TPM_CLKIN0, label: 'J1[10]/FB_AD27', identifier: FB_AD27}
- {pin_num: B7, pin_signal: ADC1_SE7b/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/I2S0_RXD1/FB_RW_b, label: 'J2[18]/U20[C9]/I2C1_SDA/DA7212_SDA', identifier: I2C1_SDA;ser1;SER1}
- {pin_num: C7, pin_signal: ADC1_SE6b/PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5/SDRAM_A13, label: 'J2[20]/U20[D8]/I2C1_SCL/DA7212_CLK', identifier: I2C1_SCL;SERVO0;BTN_CHANGE_COLOR}
- {pin_num: D7, pin_signal: ADC1_SE5b/CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/SDRAM_A14/FTM2_FLT0, label: LEDRGB_RED, identifier: LED_RED}
- {pin_num: E7, pin_signal: VDD80, label: P3V3_K66F}
- {pin_num: F7, pin_signal: VSS17, label: GND}
- {pin_num: G7, pin_signal: VSS81, label: GND}
- {pin_num: H7, pin_signal: VSS125, label: GND}
- {pin_num: J7, pin_signal: PTA6/FTM0_CH3/CLKOUT/TRACE_CLKOUT, label: 'J3[7]/CLKOUT', identifier: CLKOUT;MOTOR_EN_A_PTA6}
- {pin_num: K7, pin_signal: TSI0_CH4/PTA3/UART0_RTS_b/FTM0_CH0/LPUART0_RTS_b/JTAG_TMS/SWD_DIO, label: 'J9[2]/J12[2]/JTAG_TMS/SWD_DIO', identifier: SWD_DIO}
- {pin_num: L7, pin_signal: TSI0_CH5/PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, label: 'J3[5]/LLWU_P3/FTM0_CH1/NMI', identifier: NMI}
- {pin_num: M7, pin_signal: XTAL32, label: 'Y3[1]', identifier: XTAL32K}
- {pin_num: A8, pin_signal: ADC1_SE4b/CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7/SDRAM_A15, label: 'J1[8]/FTM3_CH4/ADC1_SE4b', identifier: FTM3_CH4}
- {pin_num: B8, pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB0_SOF_OUT/I2S0_RX_FS/FB_AD8/SDRAM_A16, label: 'J1[11]/USB0_SOF_OUT/I2S0_RX_FS/FB_AD8', identifier: USB_SOF_OUT}
- {pin_num: C8, pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/SDRAM_A17/I2S0_MCLK, label: 'J1[9]/LLWU_P10/FB_AD9/I2S0_MCLK', identifier: I2S_MCLK}
- {pin_num: D8, pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/I2S0_RXD0/FB_AD10/SDRAM_A18/CMP0_OUT/FTM0_CH2, label: 'J1[12]/I2S0_RXD0/FB_AD10/FTM0_CH2', identifier: FB_AD10}
- {pin_num: E8, pin_signal: VDD94, label: P3V3_K66F}
- {pin_num: F8, pin_signal: VDD173, label: P3V3_K66F}
- {pin_num: G8, pin_signal: VSS95, label: GND}
- {pin_num: H8, pin_signal: VSS139, label: GND}
- {pin_num: J8, pin_signal: ADC0_SE10/PTA7/FTM0_CH4/RMII0_MDIO/MII0_MDIO/TRACE_D3, label: 'J3[9]/FTM0_CH4/TRACE_D3', identifier: FTM0_CH4;MOTOR_EN_A_PTA7;MOTOR_EN_B_PTA7}
- {pin_num: K8, pin_signal: ADC0_SE11/PTA8/FTM1_CH0/RMII0_MDC/MII0_MDC/FTM1_QD_PHA/TPM1_CH0/TRACE_D2, label: 'J3[11]/FTM1_CH0/TRACE_D2', identifier: FTM1_CH0;CAMERA_FTM1_CH0;CAMERA1_FTM1_CH0}
- {pin_num: L8, pin_signal: PTA9/FTM1_CH1/MII0_RXD3/FTM1_QD_PHB/TPM1_CH1/TRACE_D1, label: 'J3[13]/FTM1_CH1/TRACE_D1', identifier: FTM1_CH1;PARALLAX1_SI_PTA9}
- {pin_num: M8, pin_signal: PTA5/USB0_CLKIN/FTM0_CH2/RMII0_RXER/MII0_RXER/CMP2_OUT/I2S0_TX_BCLK/JTAG_TRST_b, label: 'U13[17]/RMII0_RXER', identifier: RMII0_RXER}
- {pin_num: A9, pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/FB_AD11/SDRAM_A19/CMP1_OUT, label: 'J1[4]/UART1_TX/FTM0_CH3/FB_AD11', identifier: UART1_TX}
- {pin_num: B9, pin_signal: PTD9/I2C0_SDA/LPUART0_TX/FB_A17, label: 'U8[6]/U19[12]/I2C0_SDA', identifier: ACCEL_SDA;GYRO_SDA}
- {pin_num: C9, pin_signal: PTD8/LLWU_P24/I2C0_SCL/LPUART0_RX/FB_A16, label: 'U8[4]/U19[11]/I2C0_SCL', identifier: ACCEL_SCL;GYRO_SCL}
- {pin_num: D9, pin_signal: PTB21/SPI2_SCK/FB_AD30/SDRAM_D30/CMP1_OUT, label: NC}
- {pin_num: E9, pin_signal: TSI0_CH10/PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/SDRAM_D16/EWM_OUT_b/TPM_CLKIN1, label: 'U10[1]/UART0_TX', identifier: DEBUG_UART_TX}
- {pin_num: F9, pin_signal: PTB9/SPI1_PCS1/UART3_CTS_b/FB_AD20/SDRAM_D20, label: NC}
- {pin_num: G9, pin_signal: ADC1_SE11/PTB5/ENET0_1588_TMR3/FTM2_FLT0, label: 'J4[6]/ADC1_SE11', identifier: ADC1_SE11}
- {pin_num: H9, pin_signal: ADC0_SE9/ADC1_SE9/TSI0_CH6/PTB1/I2C0_SDA/FTM1_CH1/RMII0_MDC/MII0_MDC/SDRAM_RAS_b/FTM1_QD_PHB/TPM1_CH1, label: 'U13[11]/RMII0_MDC', identifier: RMII0_MDC}
- {pin_num: J9, pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/RMII0_RXD0/MII0_RXD0/I2C2_SDA/I2S0_TX_FS/FTM1_QD_PHB/TPM1_CH1, label: 'U13[13]/RMII0_RXD0', identifier: RMII0_RXD0}
- {pin_num: K9, pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/RMII0_RXD1/MII0_RXD1/I2C2_SCL/I2S0_TXD0/FTM1_QD_PHA/TPM1_CH0, label: 'U13[12]/RMII0_RXD1', identifier: RMII0_RXD1}
- {pin_num: L9, pin_signal: PTA11/LLWU_P23/FTM2_CH1/MII0_RXCLK/I2C2_SDA/FTM2_QD_PHB/TPM2_CH1, label: LEDRGB_BLUE, identifier: LED_BLUE}
- {pin_num: M9, pin_signal: PTA10/LLWU_P22/FTM2_CH0/MII0_RXD2/FTM2_QD_PHA/TPM2_CH0/TRACE_D0, label: SW3, identifier: SW3}
- {pin_num: A10, pin_signal: NC185, label: NC}
- {pin_num: B10, pin_signal: NC186, label: NC}
- {pin_num: C10, pin_signal: NC187, label: NC}
- {pin_num: D10, pin_signal: PTB20/SPI2_PCS0/FB_AD31/SDRAM_D31/CMP0_OUT, label: 'J6[3]/RF_WIFI_CE'}
- {pin_num: E10, pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/SDRAM_D17/EWM_IN/TPM_CLKIN0, label: 'U7[4]/UART0_RX', identifier: DEBUG_UART_RX}
- {pin_num: F10, pin_signal: PTB8/UART3_RTS_b/FB_AD21/SDRAM_D21, label: NC}
- {pin_num: G10, pin_signal: ADC1_SE10/PTB4/ENET0_1588_TMR2/SDRAM_CS1_b/FTM1_FLT0, label: 'J4[8]/ADC1_SE10', identifier: ADC1_SE10;CAMERA_ADC1_SE10}
- {pin_num: H10, pin_signal: ADC0_SE8/ADC1_SE8/TSI0_CH0/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/RMII0_MDIO/MII0_MDIO/SDRAM_CAS_b/FTM1_QD_PHA/TPM1_CH0, label: 'U13[10]/RMII0_MDIO',
  identifier: RMII0_MDIO}
- {pin_num: J10, pin_signal: PTA27/MII0_CRS/FB_A26, label: 'J3[1]/FB_A26', identifier: FB_A26}
- {pin_num: K10, pin_signal: CMP3_IN2/PTA16/SPI0_SOUT/UART0_CTS_b/UART0_COL_b/RMII0_TXD0/MII0_TXD0/I2S0_RX_FS/I2S0_RXD1, label: 'U13[20]/RMII0_TXD_0', identifier: RMII0_TXD_0}
- {pin_num: L10, pin_signal: PTA14/SPI0_PCS0/UART0_TX/RMII0_CRS_DV/MII0_RXDV/I2C2_SCL/I2S0_RX_BCLK/I2S0_TXD1, label: 'U13[15]/RMII0_CRS_DV', identifier: RMII0_CRS_DV}
- {pin_num: M10, pin_signal: VSS172, label: GND}
- {pin_num: A11, pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK, label: 'J1[2]/UART1_RX/FTM0_CH2/CLKOUT', identifier: UART1_RX;MOTOR_DIR_C_FTM0_CH2}
- {pin_num: B11, pin_signal: ADC0_SE15/TSI0_CH14/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FB_AD13/SDRAM_A21/I2S0_TXD0, label: 'J1[5]/U20[C5]/I2S_TXD', identifier: I2S_TXD;MOTOR_DIR_A_FTM0_CH0}
- {pin_num: C11, pin_signal: PTB23/SPI2_SIN/SPI0_PCS5/FB_AD28/SDRAM_D28/CMP3_OUT, label: 'J3[9]/CMP3_OUT', identifier: CMP_OUT}
- {pin_num: D11, pin_signal: TSI0_CH12/PTB19/CAN0_RX/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB/TPM2_CH1, label: 'J2[4]/FTM2_CH1', identifier: FTM2_CH1}
- {pin_num: E11, pin_signal: ADC1_SE15/PTB11/SPI1_SCK/UART3_TX/FB_AD18/SDRAM_D18/FTM0_FLT2, label: 'J2[9]/PTB11_RC/ADC1_SE15', identifier: PTB11_RC}
- {pin_num: E12, pin_signal: ADC1_SE14/PTB10/SPI1_PCS0/UART3_RX/FB_AD19/SDRAM_D19/FTM0_FLT1, label: 'J2[7]/PTB10_RC/ADC1_SE14', identifier: PTB10_RC}
- {pin_num: F11, pin_signal: ADC1_SE13/PTB7/FB_AD22/SDRAM_D22, label: 'J4[2]/ADC1_SE13', identifier: ADC1_SE13}
- {pin_num: G11, pin_signal: ADC0_SE13/TSI0_CH8/PTB3/I2C0_SDA/UART0_CTS_b/UART0_COL_b/ENET0_1588_TMR1/SDRAM_CS0_b/FTM0_FLT0, label: 'J4[10]/ADC0_SE13/I2C0_SDA', identifier: ADC0_SE13;MOTOR_BEMF10_B_ADC0_SE13}
- {pin_num: G12, pin_signal: ADC0_SE12/TSI0_CH7/PTB2/I2C0_SCL/UART0_RTS_b/ENET0_1588_TMR0/SDRAM_WE/FTM0_FLT3, label: 'J4[12]/ADC0_SE12/I2C0_SCL', identifier: ADC0_SE12;MOTOR_BEMF10_A_ADC0_SE12}
- {pin_num: H11, pin_signal: PTA29/MII0_COL/FB_A24, label: 'U19[3]/FXAS21002_INT1', identifier: GYRO_INT1}
- {pin_num: J11, pin_signal: PTA26/MII0_TXD3/FB_A27, label: 'J3[3]/FB_A27', identifier: FB_A27}
- {pin_num: K11, pin_signal: ADC1_SE17/PTA17/SPI0_SIN/UART0_RTS_b/RMII0_TXD1/MII0_TXD1/I2S0_MCLK, label: 'U13[21]/RMII0_TXD_1', identifier: RMII0_TXD_1}
- {pin_num: L11, pin_signal: CMP3_IN1/PTA15/SPI0_SCK/UART0_RX/RMII0_TXEN/MII0_TXEN/I2S0_RXD0, label: 'U13[19]/RMII0_TXEN', identifier: RMII0_TXEN}
- {pin_num: M11, pin_signal: XTAL0/PTA19/FTM1_FLT0/FTM_CLKIN1/LPTMR0_ALT1/TPM_CLKIN1, label: 'X501[3]', identifier: XTAL0}
- {pin_num: A12, pin_signal: ADC0_SE4b/CMP1_IN0/TSI0_CH15/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FB_AD12/SDRAM_A20/I2S0_TX_FS, label: 'J1[14]/FTM0_CH1/CMP1_IN0/FB_AD12',
  identifier: FTM0_CH1;MOTOR_DIR_B_FTM0_CH1}
- {pin_num: B12, pin_signal: ADC0_SE14/TSI0_CH13/PTC0/SPI0_PCS4/PDB0_EXTRG/USB0_SOF_OUT/FB_AD14/SDRAM_A22/I2S0_TXD1, label: 'J2[11]/ADC0_SE14', identifier: ADC0_SE14;MOTOR_BEMF1_A_ADC0_SE14}
- {pin_num: C12, pin_signal: PTB22/SPI2_SOUT/FB_AD29/SDRAM_D29/CMP2_OUT, label: NC}
- {pin_num: D12, pin_signal: TSI0_CH11/PTB18/CAN0_TX/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/SDRAM_A23/FTM2_QD_PHA/TPM2_CH0, label: 'J2[2]/FTM2_CH0', identifier: FTM2_CH0}
- {pin_num: F12, pin_signal: ADC1_SE12/PTB6/FB_AD23/SDRAM_D23, label: 'J4[4]/ADC1_SE12', identifier: ADC1_SE12}
- {pin_num: H12, pin_signal: PTA28/MII0_TXER/FB_A25, label: 'U19[2]/FXAS21002_INT2', identifier: GYRO_INT2}
- {pin_num: J12, pin_signal: CMP3_IN5/PTA25/MII0_TXCLK/FB_A28, label: 'J1[16]/CMP3_IN5', identifier: CMP3_IN5}
- {pin_num: K12, pin_signal: CMP3_IN4/PTA24/MII0_TXD2/FB_A29, label: NC}
- {pin_num: L12, pin_signal: RESET_b, label: RESET}
- {pin_num: M12, pin_signal: EXTAL0/PTA18/FTM0_FLT2/FTM_CLKIN0/TPM_CLKIN0, label: EXTAL0, identifier: EXTAL0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

