HamidHekmatnezhad/Kuruma_Uni_Project_Mikrocontroller/board/pin_mux.c
    gpio_pin_config_t MOTOR_EN_B_PTA7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA7 (pin J8)  */
    GPIO_PinInit(BOARD_MOTOR_EN_B_PTA7_GPIO, BOARD_MOTOR_EN_B_PTA7_PIN, &MOTOR_EN_B_PTA7_config);

    gpio_pin_config_t PARALLAX1_SI_PTA9_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA9 (pin L8)  */
    GPIO_PinInit(BOARD_PARALLAX1_SI_PTA9_GPIO, BOARD_PARALLAX1_SI_PTA9_PIN, &PARALLAX1_SI_PTA9_config);

    gpio_pin_config_t BTN_CHANGE_COLOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin C7)  */
    GPIO_PinInit(BOARD_BTN_CHANGE_COLOR_GPIO, BOARD_BTN_CHANGE_COLOR_PIN, &BTN_CHANGE_COLOR_config);

    gpio_pin_config_t BTN_CHANGE_PWM_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin B1)  */
    GPIO_PinInit(BOARD_BTN_CHANGE_PWM_GPIO, BOARD_BTN_CHANGE_PWM_PIN, &BTN_CHANGE_PWM_config);

    gpio_pin_config_t BTN_START_MOTOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin C3)  */
    GPIO_PinInit(BOARD_BTN_START_MOTOR_GPIO, BOARD_BTN_START_MOTOR_PIN, &BTN_START_MOTOR_config);

    /* PORTA1 (pin J6) is configured as PTA1 */
    PORT_SetPinMux(BOARD_MOTOR_EN_C_PTA1_PORT, BOARD_MOTOR_EN_C_PTA1_PIN, kPORT_MuxAsGpio);

    /* PORTA2 (pin K6) is configured as TRACE_SWO */
    PORT_SetPinMux(BOARD_TRACE_SWO_PORT, BOARD_TRACE_SWO_PIN, kPORT_MuxAlt7);

    PORTA->PCR[2] = ((PORTA->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA6 (pin J7) is configured as PTA6 */
    PORT_SetPinMux(BOARD_MOTOR_EN_A_PTA6_PORT, BOARD_MOTOR_EN_A_PTA6_PIN, kPORT_MuxAsGpio);

    /* PORTA7 (pin J8) is configured as PTA7 */
    PORT_SetPinMux(BOARD_MOTOR_EN_B_PTA7_PORT, BOARD_MOTOR_EN_B_PTA7_PIN, kPORT_MuxAsGpio);

    /* PORTA8 (pin K8) is configured as FTM1_CH0 */
    PORT_SetPinMux(BOARD_CAMERA1_FTM1_CH0_PORT, BOARD_CAMERA1_FTM1_CH0_PIN, kPORT_MuxAlt3);

    /* PORTA9 (pin L8) is configured as PTA9 */
    PORT_SetPinMux(BOARD_PARALLAX1_SI_PTA9_PORT, BOARD_PARALLAX1_SI_PTA9_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin G12) is configured as ADC0_SE12 */
    PORT_SetPinMux(BOARD_MOTOR_BEMF10_A_ADC0_SE12_PORT, BOARD_MOTOR_BEMF10_A_ADC0_SE12_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB3 (pin G11) is configured as ADC0_SE13 */
    PORT_SetPinMux(BOARD_MOTOR_BEMF10_B_ADC0_SE13_PORT, BOARD_MOTOR_BEMF10_B_ADC0_SE13_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB4 (pin G10) is configured as ADC1_SE10 */
    PORT_SetPinMux(BOARD_CAMERA_ADC1_SE10_PORT, BOARD_CAMERA_ADC1_SE10_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC0 (pin B12) is configured as ADC0_SE14 */
    PORT_SetPinMux(BOARD_MOTOR_BEMF1_A_ADC0_SE14_PORT, BOARD_MOTOR_BEMF1_A_ADC0_SE14_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC1 (pin B11) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_MOTOR_DIR_A_FTM0_CH0_PORT, BOARD_MOTOR_DIR_A_FTM0_CH0_PIN, kPORT_MuxAlt4);

    /* PORTC10 (pin C7) is configured as PTC10 */
    PORT_SetPinMux(BOARD_BTN_CHANGE_COLOR_PORT, BOARD_BTN_CHANGE_COLOR_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC10 (pin C7): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_BTN_CHANGE_COLOR_PORT, BOARD_BTN_CHANGE_COLOR_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[10] = ((PORTC->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC2 (pin A12) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_MOTOR_DIR_B_FTM0_CH1_PORT, BOARD_MOTOR_DIR_B_FTM0_CH1_PIN, kPORT_MuxAlt4);

    /* PORTC3 (pin A11) is configured as FTM0_CH2 */
    PORT_SetPinMux(BOARD_MOTOR_DIR_C_FTM0_CH2_PORT, BOARD_MOTOR_DIR_C_FTM0_CH2_PIN, kPORT_MuxAlt4);

    /* PORTC6 (pin C8) is configured as SPI0_SOUT */
    PORT_SetPinMux(BOARD_I2S_MCLK_PORT, BOARD_I2S_MCLK_PIN, kPORT_MuxAlt2);

    /* PORTD12 (pin B1) is configured as PTD12 */
    PORT_SetPinMux(BOARD_BTN_CHANGE_PWM_PORT, BOARD_BTN_CHANGE_PWM_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD12 (pin B1): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_BTN_CHANGE_PWM_PORT, BOARD_BTN_CHANGE_PWM_PIN, kPORT_InterruptFallingEdge);

    PORTD->PCR[12] = ((PORTD->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTD13 (pin C3) is configured as PTD13 */
    PORT_SetPinMux(BOARD_BTN_START_MOTOR_PORT, BOARD_BTN_START_MOTOR_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD13 (pin C3): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_BTN_START_MOTOR_PORT, BOARD_BTN_START_MOTOR_PIN, kPORT_InterruptFallingEdge);

    PORTD->PCR[13] = ((PORTD->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

